<?php

return [

    /*---基本错误 start-----*/
    1000 => [
        'msg' => '非法请求',
    ],
    10000 => [
        'msg' => '参数错误',
    ],
    10010 => [
        'msg' => '令牌失效，请重新加载页面',
    ],

    /*---后台-登录错误 start-----*/
    100001 => [
        'msg' => '该登录帐号不存在',
    ],
    100002 => [
        'msg' => '登录密码不正确',
    ],

    /*---后台-菜单错误 start-----*/
    101000 => [
        'msg' => '新增菜单失败',
    ],
    101010 => [
        'msg' => '清空缓存失败',
    ],
    101020 => [
        'msg' => '菜单数据不存在',
    ],
    101030 => [
        'msg' => '删除菜单数据失败',
    ],
    101040 => [
        'msg' => '修改菜单数据失败',
    ],
    101050 => [
        'msg' => '该菜单已经存在',
    ],

    /*---后台-用户错误 start-----*/
    102000 => [
        'msg' => '新增后台用户失败',
    ],
    102010 => [
        'msg' => '后台用户数据不存在',
    ],
    102020 => [
        'msg' => '删除后台用户数据失败',
    ],
    102030 => [
        'msg' => '修改后台用户数据失败',
    ],
    102040 => [
        'msg' => '该用户已经存在',
    ],

    /*---后台-文章错误 start-----*/
    103000 => [
        'msg' => '文章数据不存在',
    ],
    103010 => [
        'msg' => '删除文章数据失败',
    ],
    103020 => [
        'msg' => '修改文章数据失败',
    ],

    /*---后台-分类错误 start-----*/
    104000 => [
        'msg' => '分类数据不存在',
    ],
    104010 => [
        'msg' => '删除分类数据失败',
    ],
    104020 => [
        'msg' => '修改分类数据失败',
    ],
    104030 => [
        'msg' => '该分类已经存在',
    ],
    104031 => [
        'msg' => '该分类路径已经存在',
    ],
    104040 => [
        'msg' => '新增分类失败',
    ],
    104050 => [
        'msg' => '清空缓存失败',
    ],
    104060 => [
        'msg' => '生成缓存失败',
    ],

    /*---网名错误 start-----*/
    105000 => [
        'msg' => '网名数据不存在',
    ],
    105010 => [
        'msg' => '删除网名数据失败',
    ],
    105020 => [
        'msg' => '修改网名数据失败',
    ],
    105030 => [
        'msg' => '该网名已经存在',
    ],
    105040 => [
        'msg' => '新增网名失败',
    ],
];